# UndeletedConstraintsInGroup Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ConstraintFailures..::..UndeletedConstraintsInGroup Property
BuiltInFailures..::..ConstraintFailures Class See Also
---
A labeled dimension is being deleted, but the corresponding constraint belongs to a group and will not be changed. You can change it in group edit mode later.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId UndeletedConstraintsInGroup { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UndeletedConstraintsInGroup As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ UndeletedConstraintsInGroup {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ConstraintFailures Class
Autodesk.Revit.DB Namespace